#configuracion
NOTFOUND=Palabra no encontrada!.
CLICKTOSEARCH=por favor de click para buscar

#terminos
ATTRIBUTE=Atributo
CLASS=Clase
CONSTRUCTOR=Constructor
HELLOWORLD=\u00a1Hola Mundo!
EXCEPTION=Excepci\u00f3n
INTERFACE=Interfaz
JAVA=Java
JAVADOC=JavaDoc
JVM=M\u00e1quina Virtual de Java
METHOD=M\u00e9todo
PACKAGE=Paquete
THREAD=Hilo
VARIABLE=Variable

#descripciones
ATTRIBUTE_INFO=Los atributos son aquellos valores que forman parte de un objeto y representan sus caracter\u00edsticas mediante el uso de variables.
CLASS_INFO=<p>Representa tipos de objetos, pero tambi\u00e9n se puede referir a otros conceptos no relacionados con objetos como <div id="dynamic" data-bind="with: 'Package-Info'"><a class="chip blue lighten-3 white-text" href="#" data-bind="text: $data, click:$root.changeSP">Package-Info</a></div></p>
CONSTRUCTOR_INFO=Es un tipo de m\u00e9todo que construye una nueva instancia de un objeto. Si por alguna raz\u00f3nn el constructor no puede terminar, el objeto no ser\u00e1 creado.
CYCLOMATIC_COMPLEXITY=Complejidad Ciclom\u00e1tica
EXCEPTION_INFO=Exception es un evento que sucede durante la ejecuci\u00f3n de un programa y que rompe el flujo normal de las instrucciones. Las excepciones se categorizan en dos tipos: checked exceptions y unchecked exceptions
HELLOWORLD_INFO=Hola mundo es un programa que imprime la frase "\u00a1Hola Mundo!".
INTERFACE_INFO=Las interfaces son la \u00fanica manera en Java de emular la herencia m\u00faltiple. Una clase puede tener muchas interfaces, cada una le a\u00f1ade capacidades a al clase.
JAVADOC_INFO=JavaDoc son un tipo de comentarios delimitados entre los s\u00edmbolos <b>/**</b> y <b>*/</b> que sirven para documentar paquetes, clases, m\u00e9todos y variables.
JAVA_INFO=Java es un lenguaje Orientado a Objetos que puede correr en modo OO y procedural.
METHOD_INFO=Los m\u00e9todos son la manera en la que los objetos pueden realizar acciones
PACKAGE_INFO=Paquete
PACKAGE_INFO_INFO=Las clases Package-Info se usan exclusivamente para mostrar JavaDoc a nivel de paquete.
THREAD_INFO=Es un flujo de ejecuci\u00f3n, Java puede soportar M\u00faltiples hilos concurrentes y no concurrentes.
VARIABLE_INFO=Variables son tipos b\u00e1sicos u objetos con tipo b\u00e1sicos en su interior, para almacenar los valores en una ejecuci\u00f3n de programa. Pueden ser utilizadas para dos prop\u00f3sitos: almacenar datos que cambian con el tiempo o almacenar valores constantes.

#ejemplos
ATTRIBUTE_CODE=
CLASS_CODE=class <b>NOMBREDECLASE</b> {<br>}
CONSTRUCTOR_CODE=class <b>NOMBREDECLASE</b> {<br>public NOMBREDECLASE(PARAMETROS){<br>if(PARAMETROS==null){<br>System.exit(1);<br>}<br>}<br>}
CYCLOMATIC_COMPLEXITY_INFO=Es una medida para aproximar el tiempo m\u00e1ximo requerido para la ejecuci\u00f3n de una clase o m\u00e9todo. Por cada ciclo se incrementa en uno, igual que por cada condici\u00f3n.
HELLOWORLD_CODE=public class <b>HolaMundo</b>{<br>&nbsp;public static void <b>main</b>(String argumentos...){<br>&nbsp;&nbsp;System.out.println("\u00a1Hola Mundo!");<br>&nbsp;}<br>}
METHOD_CODE=

